SM_для_EDT/src/DataProcessors/рарусПостроениеМаршрутаПоАлгоритмуДейкстры/рарусПостроениеМаршрутаПоАлгоритмуДейкстры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>рарусПостроениеМаршрутаПоАлгоритмуДейкстры</name>
  <attributes>
    <name>ПунктОтправления</name>
    <type>
      <types>CatalogRef.vftПунктыСледования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктСледования</name>
    <type>
      <types>CatalogRef.vftПунктыСледования</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеРасстояниеПоПостроеннымМаршрутам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Судно</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСостава</name>
    <type>
      <types>CatalogRef.рарусТипыСоставов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПунктыПрохождения</name>
    <attributes>
      <name>Пункт</name>
      <type>
        <types>CatalogRef.vftПунктыСледования</types>
      </type>
    </attributes>
    <attributes>
      <name>Участок</name>
      <type>
        <types>CatalogRef.vftВодныеУчастки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакДвиженияПоТечению</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЗ_ПунктыДляСледующегоЭтапа</name>
    <attributes>
      <name>ПунктОтправления</name>
      <type>
        <types>CatalogRef.vftПунктыСледования</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктСледования</name>
      <type>
        <types>CatalogRef.vftПунктыСледования</types>
      </type>
    </attributes>
    <attributes>
      <name>Расстояние</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>25</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаИерархииПунктовДляМаршрута</name>
    <attributes>
      <name>НомерСтрокиРодителя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пункт</name>
      <type>
        <types>CatalogRef.vftПунктыСледования</types>
      </type>
    </attributes>
    <attributes>
      <name>Расстояние</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>25</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тупик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НайденБолееОптимальныйМаршрутКДанномуПункту</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯвляетсяГраничным</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Построен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>мНомерСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

SM_для_EDT/src/DataProcessors/рарусПостроениеМаршрутаПоАлгоритмуДейкстры/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПостроитьМаршрут(Команда)
		ПостроитьМаршрутНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПостроитьМаршрутНаСервере()
	
	текОбъект = РеквизитФормыВЗначение("Объект");
	текОбъект.ПунктыПрохождения.Очистить();
	
	АлгоритмПостроенияНаСервере(текОбъект);
	ЗначениеВДанныеФормы(текОбъект, Объект)

КонецПроцедуры

&НаСервере
Процедура АлгоритмПостроенияНаСервере(текОбъект)
	
	текОбъект.АлгоритмПостроенияНаСервере(текОбъект.ПунктОтправления, текОбъект.ПунктСледования, текОбъект.Судно, текОбъект.ТипСостава, текОбъект.Дата);
		
КонецПроцедуры
